176. Second Highest Salary

Table: Employee

+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| salary      | int  |
+-------------+------+
id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.
 

Write a solution to find the second highest distinct salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

The result format is in the following example.

 

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| null                |
+---------------------+

#### Python

In [2]:
import pandas as pd

data = {"id":[1,2,3],"salary":[100,300,200]}

employee = pd.DataFrame(data)

display(employee)

   id  salary
0   1     100
1   2     300
2   3     200

In [13]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    employee = employee.drop_duplicates("salary")
    if employee.shape[0]>=2:
        employee = employee.sort_values("salary", ascending = False)
        # select 2nd column value of the second row which is second highest salary as data is sorted in descending order
        output = employee.iloc[1][1]
    else:
        output = None
    # pass the scalar output variable as a list to DataFrame function
    output_df = pd.DataFrame([output], columns=['SecondHighestSalary']) 
    return output_df

In [14]:
second_highest_sal = second_highest_salary(employee)

In [15]:
display(second_highest_sal)

   SecondHighestSalary
0                  200

#### SQL

drop table if exists employee; 

create table employee(id int, salary int);

insert into employee values (1,100),(2,300),(3,200);

SELECT NVL((
    SELECT distinct salary
    FROM (
        SELECT  salary, dense_RANK() OVER (ORDER BY salary DESC) AS rn 
        FROM employee
    ) temp
    WHERE rn = 2
), NULL) AS SecondHighestSalary
FROM dual;